piotrcurious/IR_lights_control/ring/esp32_ring.ino
/*
  ESP32 Mesh Sequential Light Controller (single-file)
  - Master forms a token ring and assigns positions to joiners
  - Join with 3s button hold, factory reset/unlock with 10s hold
  - Master IR on GPIO 15 controls start/stop, speed, lock broadcast
  - Full peer list persisted in Preferences on master
  - ACK + retry for ASSIGN, SET_DOWN, LOCK (configurable)
  - Lock flow: master broadcasts small lock string; nodes derive PMK/LMK (SHA256)
    and install them (esp_now_set_pmk + per-peer LMK). After lock, master rejects joins.
  - Nodes still process TRIGGER messages normally while locked.
  - 8 LEDs driven by LEDC; sequence stored in PROGMEM
  - Uses ESP-NOW; designed for neighbor-relay topology (each node forwards to its downstream)
*/

#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <Preferences.h>
#include <IRremote.h>
#include "mbedtls/sha256.h"

// ----------------------------- Config -----------------------------------
#define JOIN_BTN_PIN       0      // button pin (active LOW). Adjust if needed
#define IR_PIN             15     // IR receiver pin for master
#define LED_COUNT          8
const int LED_PINS[LED_COUNT] = {2, 4, 5, 12, 13, 14, 16, 17}; // customize

const int LEDC_FREQ = 5000;
const int LEDC_RESOLUTION = 8; // 8-bit

const uint32_t JOIN_HOLD_MS = 3000;
const uint32_t FACTORY_RESET_MS = 10000;

#define MAX_NODES 60
const uint8_t BROADCAST_MAC[6] = {0xff,0xff,0xff,0xff,0xff,0xff};

uint32_t trigger_interval_ms = 500;
bool master_running = false;

Preferences prefs;

// ACK/retry tuning
const uint8_t ACK_RETRIES = 3;
const uint32_t ACK_RETRY_MS = 350;
const int MAX_PENDING_ACK = 16;

// Lock/key
#define LOCK_KEY_MAXLEN 32
char lock_key[LOCK_KEY_MAXLEN+1] = {0};
bool locked = false;
uint8_t derived_pmk[16];
uint8_t derived_lmk[16];

// IR (placeholder codes — press buttons to see raw codes in Serial and update)
const uint32_t IR_CODE_START_STOP = 0xFFFFFFFF; // toggle run/pause (placeholder)
const uint32_t IR_CODE_FREQ_UP    = 0xFFFFFFFF;
const uint32_t IR_CODE_FREQ_DOWN  = 0xFFFFFFFF;
const uint32_t IR_CODE_LOCK       = 0xFFFFFFFF; // press to broadcast lock key
// You will see raw codes printed in Serial; replace above constants with your remote's codes.

IRrecv irrecv(IR_PIN);
decode_results irresults;

// ---------------------------- Message defs --------------------------------
enum MsgType : uint8_t {
  MSG_JOIN_REQ = 1,
  MSG_ASSIGN = 2,
  MSG_SET_DOWN = 3,
  MSG_TRIGGER = 4,
  MSG_PING = 5,
  MSG_ACK = 6,
  MSG_LOCK = 7,
};

enum MsgFlags : uint8_t {
  FLAG_ACK_REQ = 0x01
};

// keep messages compact for ESP-NOW
struct MeshMsg {
  uint8_t type;        // MsgType
  uint8_t flags;       // flags bitfield
  uint8_t src_pos;     // sender pos (255=unassigned)
  uint8_t dest_pos;    // target pos (255=broadcast)
  uint16_t msg_id;     // unique ID for ACKs
  uint16_t seq;        // trigger sequence
  uint8_t hops;        // TTL for relaying
  uint8_t payload[12]; // payload small
} __attribute__((packed));

// --------------------------- Globals -------------------------------------
uint8_t myMac[6];
uint8_t downstreamMac[6];
int myPos = -1;       // -1 unassigned; master is 0
int ring_size = 1;
uint16_t trigger_seq = 0;
uint16_t next_msg_id = 1;

// Master peer list (persisted)
struct PeerInfo {
  uint8_t mac[6];
  int pos;
};
PeerInfo peers[MAX_NODES];
int peerCount = 0;

// pending ACK entries
struct PendingAck {
  bool used;
  uint16_t msg_id;
  uint8_t dest_mac[6];
  MeshMsg msg;
  uint8_t retries_left;
  uint32_t last_sent_ms;
};
PendingAck pending[MAX_PENDING_ACK];

// LED frames in PROGMEM
const uint8_t led_seq_frames[][LED_COUNT] PROGMEM = {
  {255, 0,   0,   0,   0,   0,   0,   0},
  {0,   255, 0,   0,   0,   0,   0,   0},
  {0,   0,   255, 0,   0,   0,   0,   0},
  {0,   0,   0,   255, 0,   0,   0,   0},
  {0,   0,   0,   0,   255, 0,   0,   0},
  {0,   0,   0,   0,   0,   255, 0,   0},
  {0,   0,   0,   0,   0,   0,   255, 0},
  {0,   0,   0,   0,   0,   0,   0,   255},
};
const uint8_t FRAMES = sizeof(led_seq_frames) / LED_COUNT;
const uint32_t FRAME_MS = 40;

// -------------------------- Helper functions ------------------------------
String macToStr(const uint8_t *mac) {
  char buf[18];
  sprintf(buf, "%02X:%02X:%02X:%02X:%02X:%02X",
          mac[0],mac[1],mac[2],mac[3],mac[4],mac[5]);
  return String(buf);
}

bool macIsBroadcast(const uint8_t *mac) {
  for (int i=0;i<6;i++) if (mac[i] != 0xff) return false;
  return true;
}

uint16_t allocateMsgId() {
  uint16_t id = next_msg_id++;
  if (next_msg_id == 0) next_msg_id = 1;
  return id;
}

// derive PMK/LMK from lock string using SHA-256: first 16 bytes = PMK, next 16 = LMK
void derive_keys_from_lock(const char *key) {
  uint8_t hash[32];
  size_t klen = strnlen(key, LOCK_KEY_MAXLEN);
  mbedtls_sha256_ret((const unsigned char*)key, klen, hash, 0);
  memcpy(derived_pmk, hash, 16);
  memcpy(derived_lmk, hash + 16, 16);
}

// ----------------------- ESP-NOW peer management --------------------------
void ensurePeerKnown(const uint8_t *mac) {
  if (macIsBroadcast(mac)) return;

  // check exist
  if (esp_now_is_peer_exist(mac)) return;

  esp_now_peer_info_t peerInfo;
  memset(&peerInfo, 0, sizeof(peerInfo));
  memcpy(peerInfo.peer_addr, mac, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = locked ? true : false;
#if defined(ESP_IDF_VERSION) || defined(ESP32) // try to copy LMK if available
  // attempt to copy lmk if the structure contains it (some Arduino builds expose lmk in esp_now_peer_info_t)
  memcpy(peerInfo.lmk, derived_lmk, 16);
#endif
  esp_err_t res = esp_now_add_peer(&peerInfo);
  if (res != ESP_OK) {
    Serial.printf("esp_now_add_peer failed for %s err=%d\n", macToStr(mac).c_str(), res);
  } else {
    Serial.printf("Added peer %s (encrypt=%d)\n", macToStr(mac).c_str(), peerInfo.encrypt ? 1 : 0);
  }
}

// ------------------------- Persistence -----------------------------------
void saveStateToPrefs() {
  prefs.putInt("pos", myPos);
  prefs.putInt("ringsz", ring_size);
  prefs.putBytes("down", downstreamMac, 6);
  prefs.putBool("locked", locked);
  prefs.putString("lockk", lock_key);
  Serial.println("Saved local node prefs");
}

void loadStateFromPrefs() {
  myPos = prefs.getInt("pos", -1);
  ring_size = prefs.getInt("ringsz", 1);
  size_t got = prefs.getBytes("down", downstreamMac, 6);
  if (got != 6) for (int i=0;i<6;i++) downstreamMac[i] = 0xff;
  locked = prefs.getBool("locked", false);
  String k = prefs.getString("lockk", "");
  strncpy(lock_key, k.c_str(), LOCK_KEY_MAXLEN);
  lock_key[LOCK_KEY_MAXLEN] = 0;
}

// Master peer list persistence
void saveMasterPeersToPrefs() {
  prefs.putInt("peerCount", peerCount);
  for (int i=0;i<peerCount;i++) {
    char key[16];
    snprintf(key, sizeof(key), "peer%02d", i);
    prefs.putBytes(key, peers[i].mac, 6);
  }
  Serial.printf("Master persisted %d peers\n", peerCount);
}

void loadMasterPeersFromPrefs() {
  int cnt = prefs.getInt("peerCount", -1);
  if (cnt <= 0) {
    // minimal: ensure master at pos0 later
    return;
  }
  peerCount = cnt;
  for (int i=0;i<peerCount;i++) {
    char key[16];
    snprintf(key, sizeof(key), "peer%02d", i);
    uint8_t mac[6];
    size_t got = prefs.getBytes(key, mac, 6);
    if (got == 6) {
      memcpy(peers[i].mac, mac, 6);
      peers[i].pos = i;
      Serial.printf("Loaded master peer pos %d -> %s\n", i, macToStr(mac).c_str());
    } else {
      for (int b=0;b<6;b++) peers[i].mac[b] = 0xff;
      peers[i].pos = i;
    }
  }
}

