piotrcurious/IR_lights_control/ring/esp32_ring.ino
// add master peer entry
void addMasterPeer(const uint8_t *mac, int pos) {
  if (pos < 0 || pos >= MAX_NODES) return;
  memcpy(peers[pos].mac, mac, 6);
  peers[pos].pos = pos;
  if (pos >= peerCount) peerCount = pos + 1;
  Serial.printf("Master: peer added pos %d -> %s\n", pos, macToStr(mac).c_str());
}

// find pos by mac in master list
int findPosByMac(const uint8_t *mac) {
  for (int i=0;i<peerCount;i++) {
    if (memcmp(peers[i].mac, mac, 6) == 0) return peers[i].pos;
  }
  return -1;
}

// ----------------------- Pending ACK logic -------------------------------
void queuePendingAck(const uint8_t *dest_mac, MeshMsg &m) {
  for (int i=0;i<MAX_PENDING_ACK;i++) {
    if (!pending[i].used) {
      pending[i].used = true;
      pending[i].msg_id = m.msg_id;
      memcpy(pending[i].dest_mac, dest_mac, 6);
      memcpy(&pending[i].msg, &m, sizeof(MeshMsg));
      pending[i].retries_left = ACK_RETRIES;
      pending[i].last_sent_ms = millis();
      Serial.printf("Queued pending ACK slot %d msg_id %u -> %s\n", i, m.msg_id, macToStr(dest_mac).c_str());
      return;
    }
  }
  Serial.println("No pending ACK slot free!");
}

void clearPendingForMsgId(uint16_t msg_id) {
  for (int i=0;i<MAX_PENDING_ACK;i++) {
    if (pending[i].used && pending[i].msg_id == msg_id) {
      pending[i].used = false;
      Serial.printf("Cleared pending slot %d for msg_id %u\n", i, msg_id);
    }
  }
}

void processPendingAcks() {
  uint32_t now = millis();
  for (int i=0;i<MAX_PENDING_ACK;i++) {
    if (!pending[i].used) continue;
    if ((uint32_t)(now - pending[i].last_sent_ms) >= ACK_RETRY_MS) {
      if (pending[i].retries_left == 0) {
        Serial.printf("Pending msg_id %u failed after retries; clearing slot %d\n", pending[i].msg_id, i);
        pending[i].used = false;
      } else {
        esp_err_t res = esp_now_send(pending[i].dest_mac, (uint8_t *)&pending[i].msg, sizeof(MeshMsg));
        if (res != ESP_OK) {
          Serial.printf("Resend msg_id %u err=%d\n", pending[i].msg_id, res);
        } else {
          pending[i].last_sent_ms = now;
          pending[i].retries_left--;
          Serial.printf("Resent msg_id %u to %s, retries left %d\n", pending[i].msg_id, macToStr(pending[i].dest_mac).c_str(), pending[i].retries_left);
        }
      }
    }
  }
}

// --------------------------- Sending wrapper -----------------------------
void sendMeshMsg(const uint8_t *dest_mac, MeshMsg &m, bool requireAck) {
  if (!macIsBroadcast(dest_mac)) ensurePeerKnown(dest_mac);
  esp_err_t res = esp_now_send(dest_mac, (uint8_t *)&m, sizeof(MeshMsg));
  if (res != ESP_OK) {
    Serial.printf("esp_now_send err=%d to %s\n", res, macToStr(dest_mac).c_str());
  } else {
    if (requireAck) queuePendingAck(dest_mac, m);
  }
}

// --------------------------- LED sequence --------------------------------
void playLedSequence() {
  for (uint8_t f=0; f<FRAMES; f++) {
    for (uint8_t ch=0; ch<LED_COUNT; ch++) {
      uint8_t b = pgm_read_byte(&(led_seq_frames[f][ch]));
      ledcWrite(ch, b);
    }
    delay(FRAME_MS);
  }
  for (uint8_t ch=0; ch<LED_COUNT; ch++) ledcWrite(ch, 0);
}

// ------------------------- Message handlers ------------------------------
void handleAssignMsg(const MeshMsg &msg, const uint8_t *sender_mac) {
  // payload[0]=assigned pos, payload[1]=ring_size, payload[2..7]=downstream mac
  int assigned = msg.payload[0];
  int reported_ring = msg.payload[1];
  uint8_t down[6];
  memcpy(down, &msg.payload[2], 6);
  myPos = assigned;
  ring_size = reported_ring;
  memcpy(downstreamMac, down, 6);
  Serial.printf("Assigned pos=%d ring=%d downstream=%s\n", myPos, ring_size, macToStr(downstreamMac).c_str());
  saveStateToPrefs();
}

void handleSetDownMsg(const MeshMsg &msg) {
  uint8_t newDown[6];
  memcpy(newDown, msg.payload, 6);
  memcpy(downstreamMac, newDown, 6);
  Serial.printf("SET_DOWN updated downstream=%s\n", macToStr(downstreamMac).c_str());
  saveStateToPrefs();
}

void handleLockMsg(const MeshMsg &msg) {
  uint8_t klen = msg.payload[0];
  if (klen == 0 || klen > LOCK_KEY_MAXLEN) return;
  char rkey[LOCK_KEY_MAXLEN+1];
  memcpy(rkey, &msg.payload[1], klen);
  rkey[klen] = 0;
  Serial.printf("Received LOCK key: %s\n", rkey);
  strncpy(lock_key, rkey, LOCK_KEY_MAXLEN);
  lock_key[LOCK_KEY_MAXLEN] = 0;
  derive_keys_from_lock(lock_key);
  // install PMK locally
  esp_err_t rr = esp_now_set_pmk(derived_pmk);
  Serial.printf("esp_now_set_pmk -> %d\n", rr);
  locked = true;
  prefs.putBool("locked", locked);
  prefs.putString("lockk", lock_key);
  // Note: peers will be re-added with encrypt=true when ensurePeerKnown is called
}

void handleTriggerMsg(const MeshMsg &msg) {
  if (msg.hops == 0) return;
  // Triggers are honored regardless of locked state
  if ((int)msg.dest_pos == myPos) {
    Serial.printf("Trigger for me (pos %d) seq %u\n", myPos, msg.seq);
    playLedSequence();
    // forward to next pos
    uint8_t nextpos = (myPos + 1) % ring_size;
    MeshMsg next = msg;
    next.hops = msg.hops - 1;
    next.src_pos = myPos;
    next.dest_pos = nextpos;
    next.msg_id = allocateMsgId();
    // send to downstream
    ensurePeerKnown(downstreamMac);
    bool ackReq = (msg.flags & FLAG_ACK_REQ);
    if (ackReq) next.flags |= FLAG_ACK_REQ;
    sendMeshMsg(downstreamMac, next, ackReq);
    Serial.printf("Forwarded TRIGGER to downstream %s (pos %u) ackReq=%d\n", macToStr(downstreamMac).c_str(), nextpos, ackReq ? 1 : 0);
  } else {
    // ignore if not for us
    Serial.printf("TRIGGER not for me (dest %u) - ignored\n", msg.dest_pos);
  }
}

// ---------------------- Master join handling -----------------------------
void handleJoinRequestMaster(const uint8_t *requester_mac) {
  if (locked) {
    Serial.println("Master locked: ignoring JOIN_REQ");
    return;
  }
  int existing = findPosByMac(requester_mac);
  if (existing >= 0) {
    Serial.printf("Join requester already assigned pos %d; resending ASSIGN\n", existing);
    MeshMsg m;
    memset(&m,0,sizeof(m));
    m.type = MSG_ASSIGN;
    m.flags = 0;
    m.src_pos = 0;
    m.dest_pos = existing;
    m.msg_id = allocateMsgId();
    m.seq = 0;
    m.hops = 8;
    m.payload[0] = (uint8_t)existing;
    m.payload[1] = (uint8_t)ring_size;
    memcpy(&m.payload[2], myMac, 6);
    sendMeshMsg(requester_mac, m, true);
    return;
  }
  if (peerCount >= MAX_NODES) {
    Serial.println("Master: max nodes reached, ignoring join.");
    return;
  }
  int newpos = peerCount;
  addMasterPeer(requester_mac, newpos);
  ring_size = peerCount;
  Serial.printf("Master assigns pos %d to %s (ring=%d)\n", newpos, macToStr(requester_mac).c_str(), ring_size);
  ensurePeerKnown(requester_mac); // add peer

