piotrcurious/IR_lights_control/ring/esp32_ring.ino
  // send ASSIGN
  MeshMsg assign;
  memset(&assign,0,sizeof(assign));
  assign.type = MSG_ASSIGN;
  assign.flags = 0;
  assign.src_pos = 0;
  assign.dest_pos = newpos;
  assign.msg_id = allocateMsgId();
  assign.seq = 0;
  assign.hops = 8;
  assign.payload[0] = (uint8_t)newpos;
  assign.payload[1] = (uint8_t)ring_size;
  memcpy(&assign.payload[2], myMac, 6); // default downstream for new node set to master for closing ring
  sendMeshMsg(requester_mac, assign, true);

  // instruct previous node to set its downstream to this new node
  if (newpos - 1 >= 0) {
    MeshMsg setdown;
    memset(&setdown,0,sizeof(setdown));
    setdown.type = MSG_SET_DOWN;
    setdown.flags = 0;
    setdown.src_pos = 0;
    setdown.dest_pos = newpos - 1;
    setdown.msg_id = allocateMsgId();
    setdown.seq = 0;
    setdown.hops = 8;
    memcpy(&setdown.payload[0], requester_mac, 6);
    sendMeshMsg(peers[newpos - 1].mac, setdown, true);
  }

  // persist master peers
  saveMasterPeersToPrefs();
}

// ------------------------- ESP-NOW callbacks -----------------------------
void onDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  Serial.printf("Send status to %s: %s\n", macToStr(mac_addr).c_str(),
                status == ESP_NOW_SEND_SUCCESS ? "Success" : "Fail");
}

void onDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
  if (len < (int)sizeof(MeshMsg)) {
    Serial.println("Received too-short packet");
    return;
  }
  MeshMsg msg;
  memcpy(&msg, incomingData, sizeof(MeshMsg));
  Serial.printf("Recv type %u from %s (srcpos %u destpos %u msgid %u seq %u hops %u flags 0x%02X)\n",
                msg.type, macToStr(mac).c_str(), msg.src_pos, msg.dest_pos, msg.msg_id, msg.seq, msg.hops, msg.flags);

  // If ACK -> clear pending
  if (msg.type == MSG_ACK) {
    clearPendingForMsgId(msg.msg_id);
    return;
  }

  // LOCK received
  if (msg.type == MSG_LOCK) {
    handleLockMsg(msg);
    // ack back if msg_id present
    if (msg.msg_id) {
      MeshMsg ack; memset(&ack,0,sizeof(ack));
      ack.type = MSG_ACK;
      ack.src_pos = myPos < 0 ? 255 : myPos;
      ack.dest_pos = msg.src_pos;
      ack.msg_id = msg.msg_id;
      ack.hops = 4;
      sendMeshMsg(mac, ack, false);
    }
    return;
  }

  // Master: handle JOIN_REQ from payload
  if (myPos == 0 && msg.type == MSG_JOIN_REQ) {
    uint8_t requester[6];
    memcpy(requester, msg.payload, 6);
    Serial.printf("Master: JOIN_REQ payload-mac %s (esp-now src %s)\n", macToStr(requester).c_str(), macToStr(mac).c_str());
    handleJoinRequestMaster(requester);
    return;
  }

  // Other message types
  switch (msg.type) {
    case MSG_ASSIGN:
      handleAssignMsg(msg, mac);
      // ACK
      if (msg.msg_id) {
        MeshMsg ack; memset(&ack,0,sizeof(ack));
        ack.type = MSG_ACK;
        ack.src_pos = myPos < 0 ? 255 : myPos;
        ack.dest_pos = msg.src_pos;
        ack.msg_id = msg.msg_id;
        ack.hops = 4;
        sendMeshMsg(mac, ack, false);
      }
      break;
    case MSG_SET_DOWN:
      handleSetDownMsg(msg);
      if (msg.msg_id) {
        MeshMsg ack; memset(&ack,0,sizeof(ack));
        ack.type = MSG_ACK;
        ack.src_pos = myPos < 0 ? 255 : myPos;
        ack.dest_pos = msg.src_pos;
        ack.msg_id = msg.msg_id;
        ack.hops = 4;
        sendMeshMsg(mac, ack, false);
      }
      break;
    case MSG_TRIGGER:
      handleTriggerMsg(msg);
      // reply ACK if requested
      if (msg.flags & FLAG_ACK_REQ) {
        MeshMsg ack; memset(&ack,0,sizeof(ack));
        ack.type = MSG_ACK;
        ack.src_pos = myPos < 0 ? 255 : myPos;
        ack.dest_pos = msg.src_pos;
        ack.msg_id = msg.msg_id;
        ack.hops = 4;
        sendMeshMsg(mac, ack, false);
      }
      break;
    case MSG_PING:
      Serial.println("PING received");
      break;
    default:
      Serial.printf("Unhandled message type %u\n", msg.type);
  }
}

// --------------------------- Setup & Loop --------------------------------
void setup() {
  Serial.begin(115200);
  delay(100);

  // pins
  pinMode(JOIN_BTN_PIN, INPUT_PULLUP);

  // LEDC init
  for (int i=0;i<LED_COUNT;i++){
    ledcSetup(i, LEDC_FREQ, LEDC_RESOLUTION);
    ledcAttachPin(LED_PINS[i], i);
    ledcWrite(i, 0);
  }

  prefs.begin("mesh", false);

  WiFi.mode(WIFI_STA);
  esp_read_mac(myMac, ESP_MAC_WIFI_STA);
  Serial.printf("My MAC: %s\n", macToStr(myMac).c_str());

  loadStateFromPrefs();

  // init esp-now
  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init failed");
    ESP.restart();
  }
  esp_now_register_send_cb(onDataSent);
  esp_now_register_recv_cb(onDataRecv);

  // load master peers if this device is master
  if (myPos == 0) {
    // ensure self at pos0
    addMasterPeer(myMac, 0);
    loadMasterPeersFromPrefs();
    // re-add peers to esp-now (fix encryption state)
    if (locked && lock_key[0] != 0) derive_keys_from_lock(lock_key);
    for (int i=0;i<peerCount;i++) {
      ensurePeerKnown(peers[i].mac);
    }
    // IR only for master
    irrecv.enableIRIn();
    Serial.println("Master IR receiver enabled");
  } else {
    // ensure downstream default
    bool empty=false;
    for (int i=0;i<6;i++) if (downstreamMac[i] == 0xff) empty=true;
    if (empty) memcpy(downstreamMac, BROADCAST_MAC, 6);
    // if locked at boot, install PMK
    if (locked && lock_key[0] != 0) {
      derive_keys_from_lock(lock_key);
      esp_now_set_pmk(derived_pmk);
    }
  }

  // init pending
  for (int i=0;i<MAX_PENDING_ACK;i++) pending[i].used = false;

  Serial.println("Setup done");
  Serial.printf("Loaded: pos=%d ring=%d locked=%d downstream=%s peers=%d\n",
                myPos, ring_size, locked, macToStr(downstreamMac).c_str(), peerCount);
}

uint32_t lastTriggerMillis = 0;
uint32_t lastBtnPressMs = 0;
bool btn_pressed = false;
bool btn_event_sent = false;
uint32_t lastPendingProcess = 0;

void loop() {
  // button press detection
  int b = digitalRead(JOIN_BTN_PIN);
  if (b == LOW) {
    if (!btn_pressed) {
      btn_pressed = true;
      lastBtnPressMs = millis();
      btn_event_sent = false;
    } else {
      uint32_t held = millis() - lastBtnPressMs;
      if (held >= FACTORY_RESET_MS && !btn_event_sent) {
        btn_event_sent = true;
        Serial.println("Factory reset / unlock (10s press) -> clearing prefs and rebooting");
        prefs.clear();
        delay(200);
        ESP.restart();
      } else if (held >= JOIN_HOLD_MS && !btn_event_sent) {
        btn_event_sent = true;
        Serial.println("Join request (3s press) -> clear local assignment and broadcast JOIN_REQ");
        myPos = -1;
        ring_size = 1;
        memcpy(downstreamMac, BROADCAST_MAC, 6);
        saveStateToPrefs();
        MeshMsg m; memset(&m,0,sizeof(m));
        m.type = MSG_JOIN_REQ;
        m.flags = 0;
        m.src_pos = 255;
        m.dest_pos = 255;
        m.msg_id = allocateMsgId();
        m.seq = 0;
        m.hops = 8;
        memcpy(m.payload, myMac, 6);
        sendMeshMsg(BROADCAST_MAC, m, false);
      }
    }
  } else {
    btn_pressed = false;
  }

  // master IR and trigger scheduling
  if (myPos == 0) {
    if (irrecv.decode(&irresults)) {
      unsigned long code = irresults.value;
      Serial.printf("IR raw code: 0x%08lX\n", code);
      if (code == IR_CODE_START_STOP) {
        master_running = !master_running;
        Serial.printf("Master running: %d\n", master_running);
      } else if (code == IR_CODE_FREQ_UP) {
        trigger_interval_ms = max((uint32_t)50, trigger_interval_ms - 50);
        Serial.printf("Trigger interval: %u ms\n", trigger_interval_ms);
      } else if (code == IR_CODE_FREQ_DOWN) {
        trigger_interval_ms += 50;
        Serial.printf("Trigger interval: %u ms\n", trigger_interval_ms);
      } else if (code == IR_CODE_LOCK) {
        // build a short key and broadcast
        snprintf(lock_key, LOCK_KEY_MAXLEN+1, "LK%05u", (unsigned)millis()%100000);
        Serial.printf("Master broadcasting LOCK key: %s\n", lock_key);
        derive_keys_from_lock(lock_key);
        esp_err_t r = esp_now_set_pmk(derived_pmk);
        Serial.printf("esp_now_set_pmk -> %d\n", r);
        // re-add peers with encryption enabled (remove/add)
        for (int i=0;i<peerCount;i++) {
          if (!macIsBroadcast(peers[i].mac)) {
            if (esp_now_is_peer_exist(peers[i].mac)) esp_now_del_peer(peers[i].mac);
            esp_now_peer_info_t pi; memset(&pi,0,sizeof(pi));
            memcpy(pi.peer_addr, peers[i].mac, 6);
            pi.channel = 0;
            pi.encrypt = true;
#if defined(ESP_IDF_VERSION) || defined(ESP32)
            memcpy(pi.lmk, derived_lmk, 16);
#endif
            esp_err_t rr = esp_now_add_peer(&pi);
            Serial.printf("Re-added peer %s encrypt -> %d\n", macToStr(peers[i].mac).c_str(), rr);
          }
        }
        locked = true;
        prefs.putBool("locked", locked);
        prefs.putString("lockk", lock_key);
        // broadcast LOCK (request ACKs)
        MeshMsg m; memset(&m,0,sizeof(m));
        m.type = MSG_LOCK;
        m.flags = 0;
        m.src_pos = 0;
        m.dest_pos = 255;
        m.msg_id = allocateMsgId();
        m.seq = 0;
        m.hops = 8;
        uint8_t klen = min((size_t)LOCK_KEY_MAXLEN, strlen(lock_key));
        m.payload[0] = klen;
        memcpy(&m.payload[1], lock_key, klen);
        sendMeshMsg(BROADCAST_MAC, m, true);
      }
      irrecv.resume();
    }

    // master trigger timer
    if (master_running && (millis() - lastTriggerMillis >= trigger_interval_ms)) {
      lastTriggerMillis = millis();
      Serial.printf("Master trigger seq %u\n", trigger_seq);
      // master plays its own sequence (even when locked triggers continue)
      playLedSequence();

      if (ring_size > 1 && peerCount > 1) {
        MeshMsg m; memset(&m,0,sizeof(m));
        m.type = MSG_TRIGGER;
        m.flags = 0; // set FLAG_ACK_REQ here if you want reliable forward ACKs
        m.src_pos = 0;
        m.dest_pos = 1;
        m.msg_id = allocateMsgId();
        m.seq = trigger_seq++;
        m.hops = ring_size + 4;
        sendMeshMsg(peers[1].mac, m, false); // don't require ack by default
        Serial.printf("Master sent TRIGGER to pos1 %s\n", macToStr(peers[1].mac).c_str());
      }
    }
  }

  // pending ACK processing
  if (millis() - lastPendingProcess >= 100) {
    processPendingAcks();
    lastPendingProcess = millis();
  }

  delay(10);
}
